projects/10_mixing_t_junction/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.06;

boundaryField
{
    mainInlet
    {
        type            fixedValue;
        value           uniform 0.06;
    }

    branchInlet
    {
        type            fixedValue;
        value           uniform 0.015;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 0.06;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
