projects/10_mixing_t_junction/Allrun
#!/bin/bash
#------------------------------------------------------------------------------
# Allrun script for T-junction mixing simulation
# Solver: buoyantSimpleFoam (steady-state buoyant flow with energy)
#------------------------------------------------------------------------------
cd "${0%/*}" || exit 1

# Source OpenFOAM run functions
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions

echo "=========================================="
echo " T-Junction Mixing Simulation"
echo " Solver: buoyantSimpleFoam"
echo "=========================================="

# Generate the mesh
echo ""
echo "--- Generating T-junction mesh with blockMesh ---"
runApplication blockMesh

# Check mesh quality
echo ""
echo "--- Checking mesh quality ---"
runApplication checkMesh

# Run the solver
echo ""
echo "--- Running buoyantSimpleFoam ---"
runApplication buoyantSimpleFoam

echo ""
echo "=========================================="
echo " Simulation complete!"
echo " Results written to time directories."
echo ""
echo " Post-process with:"
echo "   paraFoam"
echo "   foamToVTK"
echo "=========================================="

#------------------------------------------------------------------------------
